In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [3]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list, columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [5]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

#### Selection and indexing of columns

In [7]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [9]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [10]:
df[["Name", "Salary"]]

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

#### Creating a new column

In [17]:
df["Designation"] = ["IT", "HR", "IT", "HR"]

In [18]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000          IT
1   Anna   34     Paris   70000          HR
2  Peter   29    Berlin   62000          IT
3  Linda   42    London   85000          HR

In [19]:
df["On Leave"] = pd.Series([True, False, False, False])

In [20]:
df

    Name  Age      City  Salary Designation  On Leave
0   John   28  New York   65000          IT      True
1   Anna   34     Paris   70000          HR     False
2  Peter   29    Berlin   62000          IT     False
3  Linda   42    London   85000          HR     False

#### Removing columns

In [23]:
df.drop("On Leave", axis=1)

    Name  Age      City  Salary Designation
0   John   28  New York   65000          IT
1   Anna   34     Paris   70000          HR
2  Peter   29    Berlin   62000          IT
3  Linda   42    London   85000          HR

In [24]:
df.drop(3)

    Name  Age      City  Salary Designation  On Leave
0   John   28  New York   65000          IT      True
1   Anna   34     Paris   70000          HR     False
2  Peter   29    Berlin   62000          IT     False

In [25]:
df.drop("On Leave", axis=1, inplace=True)

In [26]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000          IT
1   Anna   34     Paris   70000          HR
2  Peter   29    Berlin   62000          IT
3  Linda   42    London   85000          HR

#### Selecting rows

In [28]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000          IT
1   Anna   34     Paris   70000          HR
2  Peter   29    Berlin   62000          IT
3  Linda   42    London   85000          HR

In [32]:
df.loc[0]

Name               John
Age                  28
City           New York
Salary            65000
Designation          IT
Name: 0, dtype: object

In [33]:
type(df.loc[0])

pandas.core.series.Series

In [34]:
df.loc[2:]

    Name  Age    City  Salary Designation
2  Peter   29  Berlin   62000          IT
3  Linda   42  London   85000          HR

In [35]:
df.loc[[1, 3]]

    Name  Age    City  Salary Designation
1   Anna   34   Paris   70000          HR
3  Linda   42  London   85000          HR

In [43]:
df.loc[:, "Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

#### Selecting Subsets of Rows and Columns

In [45]:
df.loc[[1, 3],["Name", "Salary"]]

    Name  Salary
1   Anna   70000
3  Linda   85000

#### Conditional selection

In [51]:
df[df["Salary"] > 62000]

    Name  Age      City  Salary Designation
0   John   28  New York   65000          IT
1   Anna   34     Paris   70000          HR
3  Linda   42    London   85000          HR

In [53]:
df[(df["Salary"] > 62000) & (df["Age"] > 30)]

    Name  Age    City  Salary Designation
1   Anna   34   Paris   70000          HR
3  Linda   42  London   85000          HR